# 用于单行注释
'''
  用于多行注释
'''
"""
  用于多行注释
"""
##############################################################################

#Python的输出语句

#print(*objects, sep='*', end='\n', file=sys.stdout)

'''
objects --输出的对象。输出多个对象时，需要用 , 分隔。
sep -- 间隔多个对象，在对象之间添加sep（*）字符
end -- 设定结尾符号。默认值是 \n
file -- 要写入的文件对象。
print("hello world")
'''

#############################################################################

x = 1
y = 2
z = 3
print("the values are", x, y, z)
#打印结果为 the values are 1 2 3

#############################################################################

print("1" * 3)
#打印结果为111

#############################################################################

#在代码前加入：# -*- coding： UTF-8 -*- 或者 # coding=utf-8 代表使用utf-8编码方式，可输出中文字符
